# Radix sort - це сортування, яке впорядковує числа за кожним розрядом почергово,
# від найменшого до найбільшого розряду. Це нелінійний алгоритм сортування, 
# який здійснює сортування на основі цифр числа, тобто він сортує тільки числа
# 1. Визначення максимального розряду у списку.
# 2. Створення 10 корзин (від 0 до 9) для кожного розряду.
# 3. Розподіл чисел по корзинам відповідно до розряду.
# 4. Збір чисел з корзини в список.
# 5. Повторення процедури для наступного розряду.

def counting_sort(arr, position):
    size = len(arr)  # Визначаємо розмір масиву
    output = [0] * size  # Створюємо вихідний масив такого ж розміру, заповнений нулями
    count = [0] * 10  # Створюємо масив для підрахунку кількості цифр (від 0 до 9)

    # Рахуємо кількість входжень певного розряду
    for i in range(0, size):
        index = arr[i] // position % 10  # Отримуємо цифру в поточному розряді
        count[index] += 1  # Збільшуємо кількість входжень цієї цифри

    # Оновлюємо count[i], щоб він показував позицію наступного входження своєї цифри
    for i in range(1, 10):
        count[i] += count[i - 1]  # Накопичуємо кількість попередніх цифр

    # Побудова вихідного масиву
    i = size - 1  # Починаємо з останнього елемента масиву
    while i >= 0:
        index = arr[i] // position % 10  # Отримуємо цифру в поточному розряді
        output[count[index] - 1] = arr[i]  # Розміщуємо елемент на правильну позицію в вихідному масиві
        count[index] -= 1  # Зменшуємо лічильник для цієї цифри
        i -= 1  # Переходимо до попереднього елемента
    # Копіюємо відсортовані елементи назад в початковий масив
    for i in range(0, size):
        arr[i] = output[i]  # Копіюємо елемент з вихідного масиву
    return arr  # Повертаємо відсортований масив

def radix_sort(arr):
    arr = arr[:]  # Робимо копію вхідного масиву
    # Визначаємо максимальне число для визначення кількості розрядів
    max_num = max(arr)  # Знаходимо максимальний елемент в масиві
    position = 1  # Починаємо з одиничного розряду (одиниць)
    # Виконуємо counting_sort для кожного розряду
    while max_num // position > 0:  # Поки позиція не перевищує максимальне число
        r = counting_sort(arr, position)  # Сортуємо масив за поточним розрядом
        position *= 10  # Переходимо до наступного розряду (десятки, сотні і т.д.)
    return r

if __name__ == '__main__':
   arr = [3, 89, 67, 254, 9, 21, 185, 4, 62]
   print("Вихідний масив:", arr) 
   print("Відсортований масив", radix_sort(arr))