# Алгоритм прямого выбора (Selection sort) - вибір найменшого чи найбільшого елемента зі списку і вставка 
# його на відповідну позицію.
# часова складність алгоритму квадратична - O(n^2), бо вкладені цикли для найгіршого, середнього та кращого випадку
def selection_sort(arr_):
    # Робимо копію вхідного списку arr_, щоб не змінювати оригінал
    arr= arr_[:]
    # Отримуємо довжину масиву
    n = len(arr)

    # Проходимо по всім елементам масиву
    for i in range(n):
        # Припускаємо, що поточний індекс i містить найменший елемент
        min_idx = i
         # Проходимо по елементам, що залишились (правіше поточного елемента) 
        for j in range(i+1, n):
            # Якщо знайдений елемент arr[j] менше ніж елемент arr[min_idx]
            if arr[j] < arr[min_idx]:
               # Оновлюємо індекс найменшого елемента
                min_idx = j
        # Обмінюємо місцями поточний елемент i з найменшим елементом
        arr[i], arr[min_idx] = arr[min_idx], arr[i]
    return arr

if __name__ == '__main__':
    numbers = [5, 3, 8, 4, 2]
    print(selection_sort(numbers)) # виведе: [2, 3, 4, 5, 8]