# обхід графа - алгоритмічний процес, що дозволяє відвідати всі вершини графа, при 
# цьому виконуючи певні дії на кожній вершині

# Пошук в глибину (DFS - Depth-first search) - алгоритм обходу графа, що використовує стратегію "пошук в глибину"
# виконується шляхом відвідування вершини, а потім рекурсивного відвідування всіх сусідніх вершин
# може бути ефективним для  знаходження циклу у графі або перевірки на зв'язність графа
# може бути неефективним для знаходження найкоротшого шляху між двома вершинами, особливо якщо у графах 
# з великою кількістю вершин та ребер


# Пошук в ширину (BFS - Breadth-first search) - алгоритм обходу графа, що використовує стратегію "пошук в ширину"
# відвідує спочтаку всі вершини на певному рівні, а потім переходить на наступний рівень
# ефективний для знаходження найкоротшого шляху в незважених графах
# ефективний при розв'язку завдань, які вимагають відвідування вершин у порядку їх віддаленості від початкової вершини


# циклічний граф - граф, у якому можна пройти по ребрах і повернутися в ту саму вершину
cyclic_graph = {
    'A': ['B', 'D'],
    'B': ['A', 'C'],
    'C': ['B', 'D'],
    'D': ['A', 'C']
}

# Граф містить цикл A-B-C-D і може бути обійдений за допомогою DFS

# звязаний граф - граф, у якому можна пройти від однієї вершини до будь-якої іншої
# для ненапрямленого графа можна використати DFS або BFS для перевірки на зв'язність




